rofiqcp/agv/embedded/stm32f401/src/main.cpp
static void handleTouch() {
  TouchEvent ev = pollTouch(currentPage);
  if (ev.type == TouchEvent::NONE) return;

  // All controls are edge-triggered: one PRESS = one latched command.
  // RELEASE does not cancel/repeat motion commands.
  if (ev.type == TouchEvent::PRESS) {
    if (ev.modeToggle && currentPage == PAGE_HOME) {
      const bool toManual = gTelemetry.mode != MODE_MANUAL;
      gTelemetry.mode = toManual ? MODE_MANUAL : MODE_AUTO;
      if (!toManual) {
        if (activeDriveControl == CTRL_FORWARD || activeDriveControl == CTRL_REVERSE) sendDriveStop();
        activeDriveControl = CTRL_NONE;
        activeSteerControl = CTRL_NONE;
      }
      printBoth(toManual ? "CMD:MODE:MANUAL" : "CMD:MODE:AUTO");
      updateHomePage(gTelemetry);
      publishControlState();
      return;
    }
    if (ev.home) {
      showPage(PAGE_HOME);
      return;
    }
    if (ev.navPage != PAGE_SPLASH) {
      showPage(ev.navPage);
      return;
    }
    if (currentPage == PAGE_CAMERA && ev.cameraTab != CAM_NONE) {
      currentCameraTab = ev.cameraTab;
      // Tab change is an explicit user action: one full draw is OK here.
      drawCameraPage(gTelemetry, currentCameraTab);
      publishCameraTab();
      return;
    }
    if (currentPage == PAGE_GPS && ev.waypointAction != WP_ACTION_NONE) {
      handleWaypointTap(ev.waypointAction);
      return;
    }
    if (currentPage == PAGE_ACTUATOR && ev.control != CTRL_NONE) {
      handleControlTap(ev.control);
      return;
    }
  }
}

// ---------------------------------------------------------------------------
// Serial telemetry parser
// GUI/ROS2 -> HMI examples:
// SYS:READY, MODE:MANUAL, STATE:STOPPED, SPD:1.2, HEAD:32.0,
// GPS:1, FIX:3, LAT:-7.050123, LON:110.440235, SAT:17, HDOP:0.82,
// IMU:1, CAM:1, PER:1, OBJ:PERSON, DIST:3.24, CONF:92,
// DRV:1, OBS:0, STEER_TARGET:15, STEER_ACTUAL:14.8, RPM:328, ESC:1, ENC:1
// ---------------------------------------------------------------------------
static bool eqIgnoreCase(const char* a, const char* b) {
  while (*a && *b) {
    char ca = *a++;
    char cb = *b++;
    if (ca >= 'a' && ca <= 'z') ca -= 32;
    if (cb >= 'a' && cb <= 'z') cb -= 32;
    if (ca != cb) return false;
  }
  return *a == '\0' && *b == '\0';
}

static bool parseBool(const char* s) {
  return !strcmp(s, "1") || eqIgnoreCase(s, "ON") || eqIgnoreCase(s, "READY") || eqIgnoreCase(s, "TRUE");
}

static void parseSystemStatus(const char* s) {
  if (eqIgnoreCase(s, "OFF")) gTelemetry.systemStatus = SYS_OFF;
  else if (eqIgnoreCase(s, "STARTING")) gTelemetry.systemStatus = SYS_STARTING;
  else if (eqIgnoreCase(s, "INITIALIZING")) gTelemetry.systemStatus = SYS_INITIALIZING;
  else if (eqIgnoreCase(s, "READY") || eqIgnoreCase(s, "VEHICLE READY")) gTelemetry.systemStatus = SYS_READY;
  else if (eqIgnoreCase(s, "NOT READY")) gTelemetry.systemStatus = SYS_NOT_READY;
  else if (eqIgnoreCase(s, "FAULT")) gTelemetry.systemStatus = SYS_FAULT;
}

static void parseVehicleState(const char* s) {
  if (eqIgnoreCase(s, "STANDBY")) gTelemetry.state = STATE_STANDBY;
  else if (eqIgnoreCase(s, "RUNNING")) gTelemetry.state = STATE_RUNNING;
  else if (eqIgnoreCase(s, "STOPPED") || eqIgnoreCase(s, "STOP")) gTelemetry.state = STATE_STOPPED;
  else if (eqIgnoreCase(s, "FAULT")) gTelemetry.state = STATE_FAULT;
}

static void handleSerialCommand(char* command) {
  while (*command == ' ' || *command == '\t') command++;
  if (!*command) return;
  // ROS intentionally repeats a complete state heartbeat. Snapshot the visible
  // telemetry so an identical heartbeat does not trigger any TFT transaction.
  const VehicleTelemetry telemetryBefore = gTelemetry;

  // Navigation / health commands
  if (!strcmp(command, "GET:STATE")) {
    publishPage();
    publishControlState();
    publishCameraTab();
    return;
  }
  if (!strcmp(command, "PING")) {
    printBoth("ACK:PONG");
    publishPage();
    publishControlState();
    publishCameraTab();
    return;
  }
  if (!strcmp(command, "BOOT:DFU")) {
    // Fail-safe: never leave a latched drive command active during firmware update.
    if (activeDriveControl == CTRL_FORWARD || activeDriveControl == CTRL_REVERSE) {
      sendDriveStop();
      activeDriveControl = CTRL_NONE;
    }
    printBoth("ACK:DFU");
    delay(80);
    enterSystemDfu();
    return;
  }
  if (!strcmp(command, "GOTO:HOME")) { showPage(PAGE_HOME); return; }
  if (!strcmp(command, "GOTO:CAMERA")) { showPage(PAGE_CAMERA); return; }
  if (!strcmp(command, "GOTO:GPS")) { showPage(PAGE_GPS); return; }
  if (!strcmp(command, "GOTO:ACTUATOR")) { showPage(PAGE_ACTUATOR); return; }
  if (!strcmp(command, "GOTO:SPLASH")) { restartSplash(); return; }

  // Legacy page aliases from the previous firmware, kept for old GUI compatibility.
  if (!strcmp(command, "GOTO:SENSOR")) { showPage(PAGE_GPS); return; }
  if (!strcmp(command, "GOTO:AUTO")) { showPage(PAGE_ACTUATOR); return; }
  if (!strcmp(command, "GOTO:INFO")) { showPage(PAGE_HOME); return; }

  // ROS/Web mirror commands. These change visual/control state without echoing a
  // new actuator CMD back to ROS, preventing SCADA feedback loops.
  if (!strncmp(command, "REMOTE:CAMTAB:", 14)) {
    const char* tab = command + 14;
    if (eqIgnoreCase(tab, "VIEW")) currentCameraTab = CAM_VIEW;
    else if (eqIgnoreCase(tab, "DETECT")) currentCameraTab = CAM_DETECT;
    else if (eqIgnoreCase(tab, "DRIVE")) currentCameraTab = CAM_DRIVE;
    else if (eqIgnoreCase(tab, "STATUS")) currentCameraTab = CAM_STATUS;
    else return;
    if (currentPage == PAGE_CAMERA) updateCameraPage(gTelemetry, currentCameraTab);
    publishCameraTab();
    return;
  }
  if (!strncmp(command, "REMOTE:DRIVE:", 13)) {
    const char* action = command + 13;
    if (eqIgnoreCase(action, "STOP")) {
      activeDriveControl = CTRL_NONE;
      gTelemetry.state = STATE_STOPPED;
    } else if (gTelemetry.mode == MODE_MANUAL && gTelemetry.escReady &&
               (eqIgnoreCase(action, "FWD") || eqIgnoreCase(action, "REV"))) {
      activeDriveControl = eqIgnoreCase(action, "FWD") ? CTRL_FORWARD : CTRL_REVERSE;
      gTelemetry.state = STATE_RUNNING;
    } else {
      printBoth("ERR:REMOTE_DRIVE_LOCKED");
      return;
    }
    if (currentPage == PAGE_ACTUATOR) updateActuatorPage(gTelemetry, activeDriveControl, activeSteerControl);
    publishControlState();
    return;
  }
  if (!strncmp(command, "REMOTE:STEER:", 13)) {
    const char* action = command + 13;
    if (!(gTelemetry.mode == MODE_MANUAL && gTelemetry.escReady && gTelemetry.encoderReady)) {
      printBoth("ERR:REMOTE_STEER_LOCKED");
      return;
    }
    if (eqIgnoreCase(action, "LEFT")) activeSteerControl = CTRL_LEFT;
    else if (eqIgnoreCase(action, "RIGHT")) activeSteerControl = CTRL_RIGHT;
    else if (eqIgnoreCase(action, "CENTER")) activeSteerControl = CTRL_CENTER;
    else return;
    if (currentPage == PAGE_ACTUATOR) updateActuatorPage(gTelemetry, activeDriveControl, activeSteerControl);
    publishControlState();
    return;
  }
  if (!strncmp(command, "REMOTE:SPEED:", 13)) {
    gTelemetry.manualSpeedPct = (uint8_t)constrain(atoi(command + 13), MANUAL_SPEED_MIN, MANUAL_SPEED_MAX);
    if (currentPage == PAGE_ACTUATOR) updateActuatorPage(gTelemetry, activeDriveControl, activeSteerControl);
    publishControlState();
    return;
  }

  if (!strncmp(command, "FPS:", 4)) {
    gTelemetry.cameraFps = max(0.0f, (float)atof(command + 4));
  } else if (!strncmp(command, "WPSEL:", 6)) {
    gTelemetry.selectedWaypoint = (uint8_t)constrain(atoi(command + 6), 0, HMI_WAYPOINT_COUNT - 1);
  } else if (!strncmp(command, "TARGET:", 7)) {
    snprintf(gTelemetry.activeTarget, sizeof(gTelemetry.activeTarget), "%s", command + 7);
  } else if (!strncmp(command, "NAV:", 4)) {
    const char* state = command + 4;
    if (eqIgnoreCase(state, "SELECTED")) gTelemetry.navigationStatus = NAV_SELECTED;
    else if (eqIgnoreCase(state, "QUEUED") || eqIgnoreCase(state, "SENDING")) gTelemetry.navigationStatus = NAV_QUEUED;
    else if (eqIgnoreCase(state, "NAVIGATING") || eqIgnoreCase(state, "ACTIVE")) gTelemetry.navigationStatus = NAV_NAVIGATING;
    else if (eqIgnoreCase(state, "ARRIVED") || eqIgnoreCase(state, "SUCCEEDED")) gTelemetry.navigationStatus = NAV_ARRIVED;
    else if (eqIgnoreCase(state, "STOPPED") || eqIgnoreCase(state, "CANCELED")) gTelemetry.navigationStatus = NAV_STOPPED;
    else if (eqIgnoreCase(state, "FAILED") || eqIgnoreCase(state, "ABORTED") || eqIgnoreCase(state, "REJECTED")) gTelemetry.navigationStatus = NAV_FAILED;
    else gTelemetry.navigationStatus = NAV_IDLE;
  } else if (!strncmp(command, "WP", 2) && command[2] >= '0' && command[2] <= '3' && command[3] == ':') {
    const uint8_t index = (uint8_t)(command[2] - '0');
    char* payload = command + 4;
    char* colon = strchr(payload, ':');
    if (colon != nullptr) {
      *colon = '\0';
      gTelemetry.waypointSaved[index] = parseBool(payload);
      snprintf(gTelemetry.waypointName[index], HMI_WAYPOINT_NAME_LEN, "%s", colon + 1);
    }
  } else if (!strncmp(command, "SYS:", 4)) {
    parseSystemStatus(command + 4);
    if (gTelemetry.systemStatus != SYS_READY &&
        (activeDriveControl == CTRL_FORWARD || activeDriveControl == CTRL_REVERSE)) {
      sendDriveStop();
      activeDriveControl = CTRL_NONE;
    }
    if (gTelemetry.systemStatus != SYS_READY) {
      activeSteerControl = CTRL_NONE;
    }
  } else if (!strncmp(command, "MODE:", 5)) {
    gTelemetry.mode = eqIgnoreCase(command + 5, "MANUAL") ? MODE_MANUAL : MODE_AUTO;
    if (gTelemetry.mode == MODE_AUTO) {
      if (activeDriveControl == CTRL_FORWARD || activeDriveControl == CTRL_REVERSE) {
        sendDriveStop();
      }
      activeDriveControl = CTRL_NONE;
      activeSteerControl = CTRL_NONE;
    }
  } else if (!strncmp(command, "STATE:", 6)) {
    parseVehicleState(command + 6);
    if (gTelemetry.state == STATE_STOPPED || gTelemetry.state == STATE_FAULT) {
      activeDriveControl = CTRL_NONE;
    }
  } else if (!strncmp(command, "SPD:", 4)) {
    gTelemetry.speedKmh = atof(command + 4);
  } else if (!strncmp(command, "HEAD:", 5)) {
    gTelemetry.headingDeg = atof(command + 5);
  } else if (!strncmp(command, "GPS:", 4)) {
    gTelemetry.gpsReady = parseBool(command + 4);
  } else if (!strncmp(command, "FIX:", 4)) {
    int fix = atoi(command + 4);
    if (fix <= 1) gTelemetry.gpsFix = GPS_NO_FIX;
    else if (fix == 2) gTelemetry.gpsFix = GPS_2D_FIX;
    else if (fix == 3) gTelemetry.gpsFix = GPS_3D_FIX;
    else if (fix == 4) gTelemetry.gpsFix = GPS_DEGRADED;
  } else if (!strncmp(command, "LAT:", 4)) {
    gTelemetry.latitude = atof(command + 4);
  } else if (!strncmp(command, "LON:", 4)) {
    gTelemetry.longitude = atof(command + 4);
  } else if (!strncmp(command, "SAT:", 4)) {
    gTelemetry.satellites = (uint8_t)constrain(atoi(command + 4), 0, 99);
  } else if (!strncmp(command, "HDOP:", 5)) {
    gTelemetry.hdop = atof(command + 5);
  } else if (!strncmp(command, "IMU:", 4)) {
    gTelemetry.imuReady = parseBool(command + 4);
  } else if (!strncmp(command, "CAM:", 4)) {
    gTelemetry.cameraReady = parseBool(command + 4);
  } else if (!strncmp(command, "PER:", 4)) {
    gTelemetry.perceptionReady = parseBool(command + 4);
  } else if (!strncmp(command, "OBJ:", 4)) {
    snprintf(gTelemetry.detectedObject, sizeof(gTelemetry.detectedObject), "%s", command + 4);
  } else if (!strncmp(command, "DIST:", 5)) {
    gTelemetry.objectDistanceM = atof(command + 5);
  } else if (!strncmp(command, "CONF:", 5)) {
    gTelemetry.confidencePct = atof(command + 5);
  } else if (!strncmp(command, "DRV:", 4)) {
    gTelemetry.drivableAreaClear = parseBool(command + 4);
  } else if (!strncmp(command, "OBS:", 4)) {
    gTelemetry.obstacleDetected = parseBool(command + 4);
  } else if (!strncmp(command, "STEER_TARGET:", 13)) {
    gTelemetry.steeringTargetDeg = constrain((float)atof(command + 13), STEER_MIN_DEG, STEER_MAX_DEG);
    gTelemetry.steeringErrorDeg = gTelemetry.steeringTargetDeg - gTelemetry.steeringActualDeg;
  } else if (!strncmp(command, "STEER_ACTUAL:", 13)) {
    gTelemetry.steeringActualDeg = atof(command + 13);
    gTelemetry.steeringErrorDeg = gTelemetry.steeringTargetDeg - gTelemetry.steeringActualDeg;
  } else if (!strncmp(command, "STEER_ERR:", 10)) {
    gTelemetry.steeringErrorDeg = atof(command + 10);
  } else if (!strncmp(command, "RPM:", 4)) {
    gTelemetry.motorRpm = atof(command + 4);
  } else if (!strncmp(command, "ESC:", 4)) {
    gTelemetry.escReady = parseBool(command + 4);
    if (!gTelemetry.escReady &&
        (activeDriveControl == CTRL_FORWARD || activeDriveControl == CTRL_REVERSE)) {
      sendDriveStop();
      activeDriveControl = CTRL_NONE;
    }
  } else if (!strncmp(command, "ENC:", 4)) {
    gTelemetry.encoderReady = parseBool(command + 4);
    if (!gTelemetry.encoderReady) activeSteerControl = CTRL_NONE;
  } else if (!strncmp(command, "MANUAL_SPEED:", 13)) {
    gTelemetry.manualSpeedPct = (uint8_t)constrain(atoi(command + 13), MANUAL_SPEED_MIN, MANUAL_SPEED_MAX);
  } else {
    Serial.print(F("ERR:UNKNOWN_COMMAND:"));
    Serial.println(command);
#if HMI_LEGACY_UART
    Serial1.print(F("ERR:UNKNOWN_COMMAND:"));
    Serial1.println(command);
#endif
    return;
  }

  if (memcmp(&telemetryBefore, &gTelemetry, sizeof(VehicleTelemetry)) != 0) {
    uiDirty = true;
  }
}

static void pollSerialStream(Stream& io, char* rx, uint8_t& rxLen) {
  while (io.available() > 0) {
    char c = (char)io.read();
    if (c == '\r') continue;

    if (c == '\n') {
      rx[rxLen] = '\0';
      handleSerialCommand(rx);
      rxLen = 0;
    } else if (rxLen < 127) {
      rx[rxLen++] = c;
    } else {
      rxLen = 0;
      io.println(F("ERR:COMMAND_TOO_LONG"));
    }
  }
}

static void pollSerialGui() {
  pollSerialStream(Serial, serialRx, serialRxLen);
#if HMI_LEGACY_UART
  pollSerialStream(Serial1, serial1Rx, serial1RxLen);
#endif
}

// ---------------------------------------------------------------------------
// Display / splash
// ---------------------------------------------------------------------------
static void initDisplay() {
  pinMode(PIN_TOUCH_CS, OUTPUT);
  digitalWrite(PIN_TOUCH_CS, HIGH);
  tft.init();
  tft.setRotation(1);
  // RGB565 illustration arrays use standard byte order.
  tft.setSwapBytes(true);
  tft.fillScreen(C_BG);
  tft.setTextDatum(MC_DATUM);
}

